def pangram(str):
    alphabet = "abcdefghijklmnopqrstuvwxyz" # алфавіт для перевірки текста
    for char in alphabet:                   # цикл для перевірки того, чи належить кожен символ рядка набору алфавіту чи ні
        if char not in str.lower():         # Якщо символ не відповідає алфавіту, то через умову вин замінюється на нижній регістр і повторно перевіряється,
            return False                    # якщо ні то Fallse а якщо збігається то цикл триває, якщо всі символи збігаються то True
    return True


if __name__ == '__main__':
    text = input("введіть панграмму ")      # Водимо текст
    if (pangram(text) == True):             # Умова того, що текст є панграмою через функцію,
        print("речення є панграмою")        # якщо True то текст є панграмою, а якщо Fallse то ні
    else:
        print("речення не є панграмою")
